---
kind: property
id: P:Autodesk.Revit.DB.Lighting.InitialWattageIntensity.Efficacy
source: html/3c3ceb2f-be63-a79d-d5bf-c8b03caee472.htm
---
# Autodesk.Revit.DB.Lighting.InitialWattageIntensity.Efficacy Property

The efficacy value.

## Syntax (C#)
```csharp
public double Efficacy { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The efficacy value is not valid because it is not between 0 and 1e+30.